Revit 2027 API
CableTraySizes.Contains Method
 Checks whether a cable tray size with the nominal diameter exists.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	double nominalDiameter
)
Public Function Contains (
	nominalDiameter As Double
) As Boolean
public:
bool Contains(
	double nominalDiameter
)
member Contains :
        nominalDiameter : float -> bool
Parameters
nominalDiameter Double
 Nominal diameter.
Return Value
Boolean
 True if a cable tray size with the nominal diameter exists.
See Also
Reference
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace